GopalSaraf/Practicals/PSDL/include/proc/pic18f05q40.inc
// Register: RC3PPS
#define RC3PPS RC3PPS
RC3PPS                                   equ 0214h
// bitfield definitions
RC3PPS_RC3PPS0_POSN                      equ 0000h
RC3PPS_RC3PPS0_POSITION                  equ 0000h
RC3PPS_RC3PPS0_SIZE                      equ 0001h
RC3PPS_RC3PPS0_LENGTH                    equ 0001h
RC3PPS_RC3PPS0_MASK                      equ 0001h
RC3PPS_RC3PPS1_POSN                      equ 0001h
RC3PPS_RC3PPS1_POSITION                  equ 0001h
RC3PPS_RC3PPS1_SIZE                      equ 0001h
RC3PPS_RC3PPS1_LENGTH                    equ 0001h
RC3PPS_RC3PPS1_MASK                      equ 0002h
RC3PPS_RC3PPS2_POSN                      equ 0002h
RC3PPS_RC3PPS2_POSITION                  equ 0002h
RC3PPS_RC3PPS2_SIZE                      equ 0001h
RC3PPS_RC3PPS2_LENGTH                    equ 0001h
RC3PPS_RC3PPS2_MASK                      equ 0004h
RC3PPS_RC3PPS3_POSN                      equ 0003h
RC3PPS_RC3PPS3_POSITION                  equ 0003h
RC3PPS_RC3PPS3_SIZE                      equ 0001h
RC3PPS_RC3PPS3_LENGTH                    equ 0001h
RC3PPS_RC3PPS3_MASK                      equ 0008h
RC3PPS_RC3PPS4_POSN                      equ 0004h
RC3PPS_RC3PPS4_POSITION                  equ 0004h
RC3PPS_RC3PPS4_SIZE                      equ 0001h
RC3PPS_RC3PPS4_LENGTH                    equ 0001h
RC3PPS_RC3PPS4_MASK                      equ 0010h
RC3PPS_RC3PPS5_POSN                      equ 0005h
RC3PPS_RC3PPS5_POSITION                  equ 0005h
RC3PPS_RC3PPS5_SIZE                      equ 0001h
RC3PPS_RC3PPS5_LENGTH                    equ 0001h
RC3PPS_RC3PPS5_MASK                      equ 0020h

// Register: RC4PPS
#define RC4PPS RC4PPS
RC4PPS                                   equ 0215h
// bitfield definitions
RC4PPS_RC4PPS0_POSN                      equ 0000h
RC4PPS_RC4PPS0_POSITION                  equ 0000h
RC4PPS_RC4PPS0_SIZE                      equ 0001h
RC4PPS_RC4PPS0_LENGTH                    equ 0001h
RC4PPS_RC4PPS0_MASK                      equ 0001h
RC4PPS_RC4PPS1_POSN                      equ 0001h
RC4PPS_RC4PPS1_POSITION                  equ 0001h
RC4PPS_RC4PPS1_SIZE                      equ 0001h
RC4PPS_RC4PPS1_LENGTH                    equ 0001h
RC4PPS_RC4PPS1_MASK                      equ 0002h
RC4PPS_RC4PPS2_POSN                      equ 0002h
RC4PPS_RC4PPS2_POSITION                  equ 0002h
RC4PPS_RC4PPS2_SIZE                      equ 0001h
RC4PPS_RC4PPS2_LENGTH                    equ 0001h
RC4PPS_RC4PPS2_MASK                      equ 0004h
RC4PPS_RC4PPS3_POSN                      equ 0003h
RC4PPS_RC4PPS3_POSITION                  equ 0003h
RC4PPS_RC4PPS3_SIZE                      equ 0001h
RC4PPS_RC4PPS3_LENGTH                    equ 0001h
RC4PPS_RC4PPS3_MASK                      equ 0008h
RC4PPS_RC4PPS4_POSN                      equ 0004h
RC4PPS_RC4PPS4_POSITION                  equ 0004h
RC4PPS_RC4PPS4_SIZE                      equ 0001h
RC4PPS_RC4PPS4_LENGTH                    equ 0001h
RC4PPS_RC4PPS4_MASK                      equ 0010h
RC4PPS_RC4PPS5_POSN                      equ 0005h
RC4PPS_RC4PPS5_POSITION                  equ 0005h
RC4PPS_RC4PPS5_SIZE                      equ 0001h
RC4PPS_RC4PPS5_LENGTH                    equ 0001h
RC4PPS_RC4PPS5_MASK                      equ 0020h

// Register: RC5PPS
#define RC5PPS RC5PPS
RC5PPS                                   equ 0216h
// bitfield definitions
RC5PPS_RC5PPS0_POSN                      equ 0000h
RC5PPS_RC5PPS0_POSITION                  equ 0000h
RC5PPS_RC5PPS0_SIZE                      equ 0001h
RC5PPS_RC5PPS0_LENGTH                    equ 0001h
RC5PPS_RC5PPS0_MASK                      equ 0001h
RC5PPS_RC5PPS1_POSN                      equ 0001h
RC5PPS_RC5PPS1_POSITION                  equ 0001h
RC5PPS_RC5PPS1_SIZE                      equ 0001h
RC5PPS_RC5PPS1_LENGTH                    equ 0001h
RC5PPS_RC5PPS1_MASK                      equ 0002h
RC5PPS_RC5PPS2_POSN                      equ 0002h
RC5PPS_RC5PPS2_POSITION                  equ 0002h
RC5PPS_RC5PPS2_SIZE                      equ 0001h
RC5PPS_RC5PPS2_LENGTH                    equ 0001h
RC5PPS_RC5PPS2_MASK                      equ 0004h
RC5PPS_RC5PPS3_POSN                      equ 0003h
RC5PPS_RC5PPS3_POSITION                  equ 0003h
RC5PPS_RC5PPS3_SIZE                      equ 0001h
RC5PPS_RC5PPS3_LENGTH                    equ 0001h
RC5PPS_RC5PPS3_MASK                      equ 0008h
RC5PPS_RC5PPS4_POSN                      equ 0004h
RC5PPS_RC5PPS4_POSITION                  equ 0004h
RC5PPS_RC5PPS4_SIZE                      equ 0001h
RC5PPS_RC5PPS4_LENGTH                    equ 0001h
RC5PPS_RC5PPS4_MASK                      equ 0010h
RC5PPS_RC5PPS5_POSN                      equ 0005h
RC5PPS_RC5PPS5_POSITION                  equ 0005h
RC5PPS_RC5PPS5_SIZE                      equ 0001h
RC5PPS_RC5PPS5_LENGTH                    equ 0001h
RC5PPS_RC5PPS5_MASK                      equ 0020h

// Register: INT0PPS
#define INT0PPS INT0PPS
INT0PPS                                  equ 023Eh
// bitfield definitions
INT0PPS_PIN_POSN                         equ 0000h
INT0PPS_PIN_POSITION                     equ 0000h
INT0PPS_PIN_SIZE                         equ 0003h
INT0PPS_PIN_LENGTH                       equ 0003h
INT0PPS_PIN_MASK                         equ 0007h
INT0PPS_PORT_POSN                        equ 0003h
INT0PPS_PORT_POSITION                    equ 0003h
INT0PPS_PORT_SIZE                        equ 0003h
INT0PPS_PORT_LENGTH                      equ 0003h
INT0PPS_PORT_MASK                        equ 0038h
INT0PPS_INT0PPS0_POSN                    equ 0000h
INT0PPS_INT0PPS0_POSITION                equ 0000h
INT0PPS_INT0PPS0_SIZE                    equ 0001h
INT0PPS_INT0PPS0_LENGTH                  equ 0001h
INT0PPS_INT0PPS0_MASK                    equ 0001h
INT0PPS_INT0PPS1_POSN                    equ 0001h
INT0PPS_INT0PPS1_POSITION                equ 0001h
INT0PPS_INT0PPS1_SIZE                    equ 0001h
INT0PPS_INT0PPS1_LENGTH                  equ 0001h
INT0PPS_INT0PPS1_MASK                    equ 0002h
INT0PPS_INT0PPS2_POSN                    equ 0002h
INT0PPS_INT0PPS2_POSITION                equ 0002h
INT0PPS_INT0PPS2_SIZE                    equ 0001h
INT0PPS_INT0PPS2_LENGTH                  equ 0001h
INT0PPS_INT0PPS2_MASK                    equ 0004h
INT0PPS_INT0PPS3_POSN                    equ 0003h
INT0PPS_INT0PPS3_POSITION                equ 0003h
INT0PPS_INT0PPS3_SIZE                    equ 0001h
INT0PPS_INT0PPS3_LENGTH                  equ 0001h
INT0PPS_INT0PPS3_MASK                    equ 0008h
INT0PPS_INT0PPS4_POSN                    equ 0004h
INT0PPS_INT0PPS4_POSITION                equ 0004h
INT0PPS_INT0PPS4_SIZE                    equ 0001h
INT0PPS_INT0PPS4_LENGTH                  equ 0001h
INT0PPS_INT0PPS4_MASK                    equ 0010h
INT0PPS_INT0PPS5_POSN                    equ 0005h
INT0PPS_INT0PPS5_POSITION                equ 0005h
INT0PPS_INT0PPS5_SIZE                    equ 0001h
INT0PPS_INT0PPS5_LENGTH                  equ 0001h
INT0PPS_INT0PPS5_MASK                    equ 0020h
INT0PPS_INT0PPS_POSN                     equ 0000h
INT0PPS_INT0PPS_POSITION                 equ 0000h
INT0PPS_INT0PPS_SIZE                     equ 0006h
INT0PPS_INT0PPS_LENGTH                   equ 0006h
INT0PPS_INT0PPS_MASK                     equ 003Fh

// Register: INT1PPS
#define INT1PPS INT1PPS
INT1PPS                                  equ 023Fh
// bitfield definitions
INT1PPS_PIN_POSN                         equ 0000h
INT1PPS_PIN_POSITION                     equ 0000h
INT1PPS_PIN_SIZE                         equ 0003h
INT1PPS_PIN_LENGTH                       equ 0003h
INT1PPS_PIN_MASK                         equ 0007h
INT1PPS_PORT_POSN                        equ 0003h
INT1PPS_PORT_POSITION                    equ 0003h
INT1PPS_PORT_SIZE                        equ 0003h
INT1PPS_PORT_LENGTH                      equ 0003h
INT1PPS_PORT_MASK                        equ 0038h
INT1PPS_INT1PPS0_POSN                    equ 0000h
INT1PPS_INT1PPS0_POSITION                equ 0000h
INT1PPS_INT1PPS0_SIZE                    equ 0001h
INT1PPS_INT1PPS0_LENGTH                  equ 0001h
INT1PPS_INT1PPS0_MASK                    equ 0001h
INT1PPS_INT1PPS1_POSN                    equ 0001h
INT1PPS_INT1PPS1_POSITION                equ 0001h
INT1PPS_INT1PPS1_SIZE                    equ 0001h
INT1PPS_INT1PPS1_LENGTH                  equ 0001h
INT1PPS_INT1PPS1_MASK                    equ 0002h
INT1PPS_INT1PPS2_POSN                    equ 0002h
INT1PPS_INT1PPS2_POSITION                equ 0002h
INT1PPS_INT1PPS2_SIZE                    equ 0001h
INT1PPS_INT1PPS2_LENGTH                  equ 0001h
INT1PPS_INT1PPS2_MASK                    equ 0004h
INT1PPS_INT1PPS3_POSN                    equ 0003h
INT1PPS_INT1PPS3_POSITION                equ 0003h
INT1PPS_INT1PPS3_SIZE                    equ 0001h
INT1PPS_INT1PPS3_LENGTH                  equ 0001h
INT1PPS_INT1PPS3_MASK                    equ 0008h
INT1PPS_INT1PPS4_POSN                    equ 0004h
INT1PPS_INT1PPS4_POSITION                equ 0004h
INT1PPS_INT1PPS4_SIZE                    equ 0001h
INT1PPS_INT1PPS4_LENGTH                  equ 0001h
INT1PPS_INT1PPS4_MASK                    equ 0010h
INT1PPS_INT1PPS5_POSN                    equ 0005h
INT1PPS_INT1PPS5_POSITION                equ 0005h
INT1PPS_INT1PPS5_SIZE                    equ 0001h
INT1PPS_INT1PPS5_LENGTH                  equ 0001h
INT1PPS_INT1PPS5_MASK                    equ 0020h
INT1PPS_INT1PPS_POSN                     equ 0000h
INT1PPS_INT1PPS_POSITION                 equ 0000h
INT1PPS_INT1PPS_SIZE                     equ 0006h
INT1PPS_INT1PPS_LENGTH                   equ 0006h
INT1PPS_INT1PPS_MASK                     equ 003Fh

// Register: INT2PPS
#define INT2PPS INT2PPS
INT2PPS                                  equ 0240h
// bitfield definitions
INT2PPS_PIN_POSN                         equ 0000h
INT2PPS_PIN_POSITION                     equ 0000h
INT2PPS_PIN_SIZE                         equ 0003h
INT2PPS_PIN_LENGTH                       equ 0003h
INT2PPS_PIN_MASK                         equ 0007h
INT2PPS_PORT_POSN                        equ 0003h
INT2PPS_PORT_POSITION                    equ 0003h
INT2PPS_PORT_SIZE                        equ 0003h
INT2PPS_PORT_LENGTH                      equ 0003h
INT2PPS_PORT_MASK                        equ 0038h
INT2PPS_INT2PPS0_POSN                    equ 0000h
INT2PPS_INT2PPS0_POSITION                equ 0000h
INT2PPS_INT2PPS0_SIZE                    equ 0001h
INT2PPS_INT2PPS0_LENGTH                  equ 0001h
INT2PPS_INT2PPS0_MASK                    equ 0001h
INT2PPS_INT2PPS1_POSN                    equ 0001h
INT2PPS_INT2PPS1_POSITION                equ 0001h
INT2PPS_INT2PPS1_SIZE                    equ 0001h
INT2PPS_INT2PPS1_LENGTH                  equ 0001h
INT2PPS_INT2PPS1_MASK                    equ 0002h
INT2PPS_INT2PPS2_POSN                    equ 0002h
INT2PPS_INT2PPS2_POSITION                equ 0002h
INT2PPS_INT2PPS2_SIZE                    equ 0001h
INT2PPS_INT2PPS2_LENGTH                  equ 0001h
INT2PPS_INT2PPS2_MASK                    equ 0004h
INT2PPS_INT2PPS3_POSN                    equ 0003h
INT2PPS_INT2PPS3_POSITION                equ 0003h
INT2PPS_INT2PPS3_SIZE                    equ 0001h
INT2PPS_INT2PPS3_LENGTH                  equ 0001h
INT2PPS_INT2PPS3_MASK                    equ 0008h
INT2PPS_INT2PPS4_POSN                    equ 0004h
INT2PPS_INT2PPS4_POSITION                equ 0004h
INT2PPS_INT2PPS4_SIZE                    equ 0001h
INT2PPS_INT2PPS4_LENGTH                  equ 0001h
INT2PPS_INT2PPS4_MASK                    equ 0010h
INT2PPS_INT2PPS5_POSN                    equ 0005h
INT2PPS_INT2PPS5_POSITION                equ 0005h
INT2PPS_INT2PPS5_SIZE                    equ 0001h
INT2PPS_INT2PPS5_LENGTH                  equ 0001h
INT2PPS_INT2PPS5_MASK                    equ 0020h
INT2PPS_INT2PPS_POSN                     equ 0000h
INT2PPS_INT2PPS_POSITION                 equ 0000h
INT2PPS_INT2PPS_SIZE                     equ 0006h
INT2PPS_INT2PPS_LENGTH                   equ 0006h
INT2PPS_INT2PPS_MASK                     equ 003Fh

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 0241h
// bitfield definitions
T0CKIPPS_PIN_POSN                        equ 0000h
T0CKIPPS_PIN_POSITION                    equ 0000h
T0CKIPPS_PIN_SIZE                        equ 0003h
T0CKIPPS_PIN_LENGTH                      equ 0003h
T0CKIPPS_PIN_MASK                        equ 0007h
T0CKIPPS_PORT_POSN                       equ 0003h
T0CKIPPS_PORT_POSITION                   equ 0003h
T0CKIPPS_PORT_SIZE                       equ 0003h
T0CKIPPS_PORT_LENGTH                     equ 0003h
T0CKIPPS_PORT_MASK                       equ 0038h
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0006h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0006h
T0CKIPPS_T0CKIPPS_MASK                   equ 003Fh
T0CKIPPS_T0CKIPPS0_POSN                  equ 0000h
T0CKIPPS_T0CKIPPS0_POSITION              equ 0000h
T0CKIPPS_T0CKIPPS0_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS0_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS0_MASK                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSN                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSITION              equ 0001h
T0CKIPPS_T0CKIPPS1_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS1_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS1_MASK                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSN                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSITION              equ 0002h
T0CKIPPS_T0CKIPPS2_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS2_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS2_MASK                  equ 0004h
T0CKIPPS_T0CKIPPS3_POSN                  equ 0003h
T0CKIPPS_T0CKIPPS3_POSITION              equ 0003h
T0CKIPPS_T0CKIPPS3_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS3_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS3_MASK                  equ 0008h
T0CKIPPS_T0CKIPPS4_POSN                  equ 0004h
T0CKIPPS_T0CKIPPS4_POSITION              equ 0004h
T0CKIPPS_T0CKIPPS4_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS4_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS4_MASK                  equ 0010h
T0CKIPPS_T0CKIPPS5_POSN                  equ 0005h
T0CKIPPS_T0CKIPPS5_POSITION              equ 0005h
T0CKIPPS_T0CKIPPS5_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS5_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS5_MASK                  equ 0020h

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 0242h
// bitfield definitions
T1CKIPPS_PIN_POSN                        equ 0000h
T1CKIPPS_PIN_POSITION                    equ 0000h
T1CKIPPS_PIN_SIZE                        equ 0003h
T1CKIPPS_PIN_LENGTH                      equ 0003h
T1CKIPPS_PIN_MASK                        equ 0007h
T1CKIPPS_PORT_POSN                       equ 0003h
T1CKIPPS_PORT_POSITION                   equ 0003h
T1CKIPPS_PORT_SIZE                       equ 0003h
T1CKIPPS_PORT_LENGTH                     equ 0003h
T1CKIPPS_PORT_MASK                       equ 0038h
T1CKIPPS_T1CKIPPS0_POSN                  equ 0000h
T1CKIPPS_T1CKIPPS0_POSITION              equ 0000h
T1CKIPPS_T1CKIPPS0_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS0_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS0_MASK                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSN                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSITION              equ 0001h
T1CKIPPS_T1CKIPPS1_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS1_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS1_MASK                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSN                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSITION              equ 0002h
T1CKIPPS_T1CKIPPS2_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS2_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS2_MASK                  equ 0004h
T1CKIPPS_T1CKIPPS3_POSN                  equ 0003h
T1CKIPPS_T1CKIPPS3_POSITION              equ 0003h
T1CKIPPS_T1CKIPPS3_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS3_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS3_MASK                  equ 0008h
T1CKIPPS_T1CKIPPS4_POSN                  equ 0004h
T1CKIPPS_T1CKIPPS4_POSITION              equ 0004h
T1CKIPPS_T1CKIPPS4_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS4_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS4_MASK                  equ 0010h
T1CKIPPS_T1CKIPPS5_POSN                  equ 0005h
T1CKIPPS_T1CKIPPS5_POSITION              equ 0005h
T1CKIPPS_T1CKIPPS5_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS5_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS5_MASK                  equ 0020h
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0006h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0006h
T1CKIPPS_T1CKIPPS_MASK                   equ 003Fh

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 0243h
// bitfield definitions
T1GPPS_PIN_POSN                          equ 0000h
T1GPPS_PIN_POSITION                      equ 0000h
T1GPPS_PIN_SIZE                          equ 0003h
T1GPPS_PIN_LENGTH                        equ 0003h
T1GPPS_PIN_MASK                          equ 0007h
T1GPPS_PORT_POSN                         equ 0003h
T1GPPS_PORT_POSITION                     equ 0003h
T1GPPS_PORT_SIZE                         equ 0003h
T1GPPS_PORT_LENGTH                       equ 0003h
T1GPPS_PORT_MASK                         equ 0038h
T1GPPS_T1GPPS0_POSN                      equ 0000h
T1GPPS_T1GPPS0_POSITION                  equ 0000h
T1GPPS_T1GPPS0_SIZE                      equ 0001h
T1GPPS_T1GPPS0_LENGTH                    equ 0001h
T1GPPS_T1GPPS0_MASK                      equ 0001h
T1GPPS_T1GPPS1_POSN                      equ 0001h
T1GPPS_T1GPPS1_POSITION                  equ 0001h
T1GPPS_T1GPPS1_SIZE                      equ 0001h
T1GPPS_T1GPPS1_LENGTH                    equ 0001h
T1GPPS_T1GPPS1_MASK                      equ 0002h
T1GPPS_T1GPPS2_POSN                      equ 0002h
T1GPPS_T1GPPS2_POSITION                  equ 0002h
T1GPPS_T1GPPS2_SIZE                      equ 0001h
T1GPPS_T1GPPS2_LENGTH                    equ 0001h
T1GPPS_T1GPPS2_MASK                      equ 0004h
T1GPPS_T1GPPS3_POSN                      equ 0003h
T1GPPS_T1GPPS3_POSITION                  equ 0003h
T1GPPS_T1GPPS3_SIZE                      equ 0001h
T1GPPS_T1GPPS3_LENGTH                    equ 0001h
T1GPPS_T1GPPS3_MASK                      equ 0008h
T1GPPS_T1GPPS4_POSN                      equ 0004h
T1GPPS_T1GPPS4_POSITION                  equ 0004h
T1GPPS_T1GPPS4_SIZE                      equ 0001h
T1GPPS_T1GPPS4_LENGTH                    equ 0001h
T1GPPS_T1GPPS4_MASK                      equ 0010h
T1GPPS_T1GPPS5_POSN                      equ 0005h
T1GPPS_T1GPPS5_POSITION                  equ 0005h
T1GPPS_T1GPPS5_SIZE                      equ 0001h
T1GPPS_T1GPPS5_LENGTH                    equ 0001h
T1GPPS_T1GPPS5_MASK                      equ 0020h
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0006h
T1GPPS_T1GPPS_LENGTH                     equ 0006h
T1GPPS_T1GPPS_MASK                       equ 003Fh

