GopalSaraf/Practicals/PSDL/include/proc/pic18f05q40.inc
// Register: I2C1STAT1
#define I2C1STAT1 I2C1STAT1
I2C1STAT1                                equ 0299h
// bitfield definitions
I2C1STAT1_RXBF_POSN                      equ 0000h
I2C1STAT1_RXBF_POSITION                  equ 0000h
I2C1STAT1_RXBF_SIZE                      equ 0001h
I2C1STAT1_RXBF_LENGTH                    equ 0001h
I2C1STAT1_RXBF_MASK                      equ 0001h
I2C1STAT1_CLRBF_POSN                     equ 0002h
I2C1STAT1_CLRBF_POSITION                 equ 0002h
I2C1STAT1_CLRBF_SIZE                     equ 0001h
I2C1STAT1_CLRBF_LENGTH                   equ 0001h
I2C1STAT1_CLRBF_MASK                     equ 0004h
I2C1STAT1_RXRE_POSN                      equ 0003h
I2C1STAT1_RXRE_POSITION                  equ 0003h
I2C1STAT1_RXRE_SIZE                      equ 0001h
I2C1STAT1_RXRE_LENGTH                    equ 0001h
I2C1STAT1_RXRE_MASK                      equ 0008h
I2C1STAT1_TXBE_POSN                      equ 0005h
I2C1STAT1_TXBE_POSITION                  equ 0005h
I2C1STAT1_TXBE_SIZE                      equ 0001h
I2C1STAT1_TXBE_LENGTH                    equ 0001h
I2C1STAT1_TXBE_MASK                      equ 0020h
I2C1STAT1_TXWE_POSN                      equ 0007h
I2C1STAT1_TXWE_POSITION                  equ 0007h
I2C1STAT1_TXWE_SIZE                      equ 0001h
I2C1STAT1_TXWE_LENGTH                    equ 0001h
I2C1STAT1_TXWE_MASK                      equ 0080h

// Register: I2C1PIR
#define I2C1PIR I2C1PIR
I2C1PIR                                  equ 029Ah
// bitfield definitions
I2C1PIR_SCIF_POSN                        equ 0000h
I2C1PIR_SCIF_POSITION                    equ 0000h
I2C1PIR_SCIF_SIZE                        equ 0001h
I2C1PIR_SCIF_LENGTH                      equ 0001h
I2C1PIR_SCIF_MASK                        equ 0001h
I2C1PIR_RSCIF_POSN                       equ 0001h
I2C1PIR_RSCIF_POSITION                   equ 0001h
I2C1PIR_RSCIF_SIZE                       equ 0001h
I2C1PIR_RSCIF_LENGTH                     equ 0001h
I2C1PIR_RSCIF_MASK                       equ 0002h
I2C1PIR_PCIF_POSN                        equ 0002h
I2C1PIR_PCIF_POSITION                    equ 0002h
I2C1PIR_PCIF_SIZE                        equ 0001h
I2C1PIR_PCIF_LENGTH                      equ 0001h
I2C1PIR_PCIF_MASK                        equ 0004h
I2C1PIR_ADRIF_POSN                       equ 0003h
I2C1PIR_ADRIF_POSITION                   equ 0003h
I2C1PIR_ADRIF_SIZE                       equ 0001h
I2C1PIR_ADRIF_LENGTH                     equ 0001h
I2C1PIR_ADRIF_MASK                       equ 0008h
I2C1PIR_WRIF_POSN                        equ 0004h
I2C1PIR_WRIF_POSITION                    equ 0004h
I2C1PIR_WRIF_SIZE                        equ 0001h
I2C1PIR_WRIF_LENGTH                      equ 0001h
I2C1PIR_WRIF_MASK                        equ 0010h
I2C1PIR_ACKTIF_POSN                      equ 0006h
I2C1PIR_ACKTIF_POSITION                  equ 0006h
I2C1PIR_ACKTIF_SIZE                      equ 0001h
I2C1PIR_ACKTIF_LENGTH                    equ 0001h
I2C1PIR_ACKTIF_MASK                      equ 0040h
I2C1PIR_CNTIF_POSN                       equ 0007h
I2C1PIR_CNTIF_POSITION                   equ 0007h
I2C1PIR_CNTIF_SIZE                       equ 0001h
I2C1PIR_CNTIF_LENGTH                     equ 0001h
I2C1PIR_CNTIF_MASK                       equ 0080h
I2C1PIR_SC1IF_POSN                       equ 0000h
I2C1PIR_SC1IF_POSITION                   equ 0000h
I2C1PIR_SC1IF_SIZE                       equ 0001h
I2C1PIR_SC1IF_LENGTH                     equ 0001h
I2C1PIR_SC1IF_MASK                       equ 0001h
I2C1PIR_RSC1IF_POSN                      equ 0001h
I2C1PIR_RSC1IF_POSITION                  equ 0001h
I2C1PIR_RSC1IF_SIZE                      equ 0001h
I2C1PIR_RSC1IF_LENGTH                    equ 0001h
I2C1PIR_RSC1IF_MASK                      equ 0002h
I2C1PIR_PC1IF_POSN                       equ 0002h
I2C1PIR_PC1IF_POSITION                   equ 0002h
I2C1PIR_PC1IF_SIZE                       equ 0001h
I2C1PIR_PC1IF_LENGTH                     equ 0001h
I2C1PIR_PC1IF_MASK                       equ 0004h
I2C1PIR_ADR1IF_POSN                      equ 0003h
I2C1PIR_ADR1IF_POSITION                  equ 0003h
I2C1PIR_ADR1IF_SIZE                      equ 0001h
I2C1PIR_ADR1IF_LENGTH                    equ 0001h
I2C1PIR_ADR1IF_MASK                      equ 0008h
I2C1PIR_WR1IF_POSN                       equ 0004h
I2C1PIR_WR1IF_POSITION                   equ 0004h
I2C1PIR_WR1IF_SIZE                       equ 0001h
I2C1PIR_WR1IF_LENGTH                     equ 0001h
I2C1PIR_WR1IF_MASK                       equ 0010h
I2C1PIR_ACKT1IF_POSN                     equ 0006h
I2C1PIR_ACKT1IF_POSITION                 equ 0006h
I2C1PIR_ACKT1IF_SIZE                     equ 0001h
I2C1PIR_ACKT1IF_LENGTH                   equ 0001h
I2C1PIR_ACKT1IF_MASK                     equ 0040h
I2C1PIR_CNT1IF_POSN                      equ 0007h
I2C1PIR_CNT1IF_POSITION                  equ 0007h
I2C1PIR_CNT1IF_SIZE                      equ 0001h
I2C1PIR_CNT1IF_LENGTH                    equ 0001h
I2C1PIR_CNT1IF_MASK                      equ 0080h

// Register: I2C1PIE
#define I2C1PIE I2C1PIE
I2C1PIE                                  equ 029Bh
// bitfield definitions
I2C1PIE_SCIE_POSN                        equ 0000h
I2C1PIE_SCIE_POSITION                    equ 0000h
I2C1PIE_SCIE_SIZE                        equ 0001h
I2C1PIE_SCIE_LENGTH                      equ 0001h
I2C1PIE_SCIE_MASK                        equ 0001h
I2C1PIE_RSCIE_POSN                       equ 0001h
I2C1PIE_RSCIE_POSITION                   equ 0001h
I2C1PIE_RSCIE_SIZE                       equ 0001h
I2C1PIE_RSCIE_LENGTH                     equ 0001h
I2C1PIE_RSCIE_MASK                       equ 0002h
I2C1PIE_PCIE_POSN                        equ 0002h
I2C1PIE_PCIE_POSITION                    equ 0002h
I2C1PIE_PCIE_SIZE                        equ 0001h
I2C1PIE_PCIE_LENGTH                      equ 0001h
I2C1PIE_PCIE_MASK                        equ 0004h
I2C1PIE_ADRIE_POSN                       equ 0003h
I2C1PIE_ADRIE_POSITION                   equ 0003h
I2C1PIE_ADRIE_SIZE                       equ 0001h
I2C1PIE_ADRIE_LENGTH                     equ 0001h
I2C1PIE_ADRIE_MASK                       equ 0008h
I2C1PIE_WRIE_POSN                        equ 0004h
I2C1PIE_WRIE_POSITION                    equ 0004h
I2C1PIE_WRIE_SIZE                        equ 0001h
I2C1PIE_WRIE_LENGTH                      equ 0001h
I2C1PIE_WRIE_MASK                        equ 0010h
I2C1PIE_ACKTIE_POSN                      equ 0006h
I2C1PIE_ACKTIE_POSITION                  equ 0006h
I2C1PIE_ACKTIE_SIZE                      equ 0001h
I2C1PIE_ACKTIE_LENGTH                    equ 0001h
I2C1PIE_ACKTIE_MASK                      equ 0040h
I2C1PIE_CNTIE_POSN                       equ 0007h
I2C1PIE_CNTIE_POSITION                   equ 0007h
I2C1PIE_CNTIE_SIZE                       equ 0001h
I2C1PIE_CNTIE_LENGTH                     equ 0001h
I2C1PIE_CNTIE_MASK                       equ 0080h
I2C1PIE_SC1IE_POSN                       equ 0000h
I2C1PIE_SC1IE_POSITION                   equ 0000h
I2C1PIE_SC1IE_SIZE                       equ 0001h
I2C1PIE_SC1IE_LENGTH                     equ 0001h
I2C1PIE_SC1IE_MASK                       equ 0001h
I2C1PIE_RSC1IE_POSN                      equ 0001h
I2C1PIE_RSC1IE_POSITION                  equ 0001h
I2C1PIE_RSC1IE_SIZE                      equ 0001h
I2C1PIE_RSC1IE_LENGTH                    equ 0001h
I2C1PIE_RSC1IE_MASK                      equ 0002h
I2C1PIE_PC1IE_POSN                       equ 0002h
I2C1PIE_PC1IE_POSITION                   equ 0002h
I2C1PIE_PC1IE_SIZE                       equ 0001h
I2C1PIE_PC1IE_LENGTH                     equ 0001h
I2C1PIE_PC1IE_MASK                       equ 0004h
I2C1PIE_ADR1IE_POSN                      equ 0003h
I2C1PIE_ADR1IE_POSITION                  equ 0003h
I2C1PIE_ADR1IE_SIZE                      equ 0001h
I2C1PIE_ADR1IE_LENGTH                    equ 0001h
I2C1PIE_ADR1IE_MASK                      equ 0008h
I2C1PIE_WR1IE_POSN                       equ 0004h
I2C1PIE_WR1IE_POSITION                   equ 0004h
I2C1PIE_WR1IE_SIZE                       equ 0001h
I2C1PIE_WR1IE_LENGTH                     equ 0001h
I2C1PIE_WR1IE_MASK                       equ 0010h
I2C1PIE_ACKT1IE_POSN                     equ 0006h
I2C1PIE_ACKT1IE_POSITION                 equ 0006h
I2C1PIE_ACKT1IE_SIZE                     equ 0001h
I2C1PIE_ACKT1IE_LENGTH                   equ 0001h
I2C1PIE_ACKT1IE_MASK                     equ 0040h
I2C1PIE_CNT1IE_POSN                      equ 0007h
I2C1PIE_CNT1IE_POSITION                  equ 0007h
I2C1PIE_CNT1IE_SIZE                      equ 0001h
I2C1PIE_CNT1IE_LENGTH                    equ 0001h
I2C1PIE_CNT1IE_MASK                      equ 0080h

