GopalSaraf/Practicals/PSDL/include/proc/pic18f05q40.inc
// Register: PCLATU_SHAD
#define PCLATU_SHAD PCLATU_SHAD
PCLATU_SHAD                              equ 037Bh
// bitfield definitions
PCLATU_SHAD_PCU_POSN                     equ 0000h
PCLATU_SHAD_PCU_POSITION                 equ 0000h
PCLATU_SHAD_PCU_SIZE                     equ 0005h
PCLATU_SHAD_PCU_LENGTH                   equ 0005h
PCLATU_SHAD_PCU_MASK                     equ 001Fh

// Register: FSR0SH
#define FSR0SH FSR0SH
FSR0SH                                   equ 037Ch

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 037Ch
// bitfield definitions
FSR0L_SHAD_FSR0L_POSN                    equ 0000h
FSR0L_SHAD_FSR0L_POSITION                equ 0000h
FSR0L_SHAD_FSR0L_SIZE                    equ 0008h
FSR0L_SHAD_FSR0L_LENGTH                  equ 0008h
FSR0L_SHAD_FSR0L_MASK                    equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 037Dh
// bitfield definitions
FSR0H_SHAD_FSR0H_POSN                    equ 0000h
FSR0H_SHAD_FSR0H_POSITION                equ 0000h
FSR0H_SHAD_FSR0H_SIZE                    equ 0006h
FSR0H_SHAD_FSR0H_LENGTH                  equ 0006h
FSR0H_SHAD_FSR0H_MASK                    equ 003Fh

// Register: FSR1SH
#define FSR1SH FSR1SH
FSR1SH                                   equ 037Eh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 037Eh
// bitfield definitions
FSR1L_SHAD_FSR1L_POSN                    equ 0000h
FSR1L_SHAD_FSR1L_POSITION                equ 0000h
FSR1L_SHAD_FSR1L_SIZE                    equ 0008h
FSR1L_SHAD_FSR1L_LENGTH                  equ 0008h
FSR1L_SHAD_FSR1L_MASK                    equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 037Fh
// bitfield definitions
FSR1H_SHAD_FSR1H_POSN                    equ 0000h
FSR1H_SHAD_FSR1H_POSITION                equ 0000h
FSR1H_SHAD_FSR1H_SIZE                    equ 0006h
FSR1H_SHAD_FSR1H_LENGTH                  equ 0006h
FSR1H_SHAD_FSR1H_MASK                    equ 003Fh

// Register: FSR2SH
#define FSR2SH FSR2SH
FSR2SH                                   equ 0380h

// Register: FSR2L_SHAD
#define FSR2L_SHAD FSR2L_SHAD
FSR2L_SHAD                               equ 0380h
// bitfield definitions
FSR2L_SHAD_FSR2L_POSN                    equ 0000h
FSR2L_SHAD_FSR2L_POSITION                equ 0000h
FSR2L_SHAD_FSR2L_SIZE                    equ 0008h
FSR2L_SHAD_FSR2L_LENGTH                  equ 0008h
FSR2L_SHAD_FSR2L_MASK                    equ 00FFh

// Register: FSR2H_SHAD
#define FSR2H_SHAD FSR2H_SHAD
FSR2H_SHAD                               equ 0381h
// bitfield definitions
FSR2H_SHAD_FSR2H_POSN                    equ 0000h
FSR2H_SHAD_FSR2H_POSITION                equ 0000h
FSR2H_SHAD_FSR2H_SIZE                    equ 0006h
FSR2H_SHAD_FSR2H_LENGTH                  equ 0006h
FSR2H_SHAD_FSR2H_MASK                    equ 003Fh

// Register: PRODSH
#define PRODSH PRODSH
PRODSH                                   equ 0382h

// Register: PRODL_SHAD
#define PRODL_SHAD PRODL_SHAD
PRODL_SHAD                               equ 0382h
// bitfield definitions
PRODL_SHAD_PRODL_POSN                    equ 0000h
PRODL_SHAD_PRODL_POSITION                equ 0000h
PRODL_SHAD_PRODL_SIZE                    equ 0008h
PRODL_SHAD_PRODL_LENGTH                  equ 0008h
PRODL_SHAD_PRODL_MASK                    equ 00FFh

// Register: PRODH_SHAD
#define PRODH_SHAD PRODH_SHAD
PRODH_SHAD                               equ 0383h
// bitfield definitions
PRODH_SHAD_PRODH_POSN                    equ 0000h
PRODH_SHAD_PRODH_POSITION                equ 0000h
PRODH_SHAD_PRODH_SIZE                    equ 0008h
PRODH_SHAD_PRODH_LENGTH                  equ 0008h
PRODH_SHAD_PRODH_MASK                    equ 00FFh

// Register: CWG1CLK
#define CWG1CLK CWG1CLK
CWG1CLK                                  equ 03BCh
// bitfield definitions
CWG1CLK_CS_POSN                          equ 0000h
CWG1CLK_CS_POSITION                      equ 0000h
CWG1CLK_CS_SIZE                          equ 0001h
CWG1CLK_CS_LENGTH                        equ 0001h
CWG1CLK_CS_MASK                          equ 0001h
CWG1CLK_CWG1CS_POSN                      equ 0000h
CWG1CLK_CWG1CS_POSITION                  equ 0000h
CWG1CLK_CWG1CS_SIZE                      equ 0001h
CWG1CLK_CWG1CS_LENGTH                    equ 0001h
CWG1CLK_CWG1CS_MASK                      equ 0001h

// Register: CWG1ISM
#define CWG1ISM CWG1ISM
CWG1ISM                                  equ 03BDh
// bitfield definitions
CWG1ISM_ISM_POSN                         equ 0000h
CWG1ISM_ISM_POSITION                     equ 0000h
CWG1ISM_ISM_SIZE                         equ 0008h
CWG1ISM_ISM_LENGTH                       equ 0008h
CWG1ISM_ISM_MASK                         equ 00FFh
CWG1ISM_CWG1ISM_POSN                     equ 0000h
CWG1ISM_CWG1ISM_POSITION                 equ 0000h
CWG1ISM_CWG1ISM_SIZE                     equ 0008h
CWG1ISM_CWG1ISM_LENGTH                   equ 0008h
CWG1ISM_CWG1ISM_MASK                     equ 00FFh
CWG1ISM_ISM0_POSN                        equ 0000h
CWG1ISM_ISM0_POSITION                    equ 0000h
CWG1ISM_ISM0_SIZE                        equ 0001h
CWG1ISM_ISM0_LENGTH                      equ 0001h
CWG1ISM_ISM0_MASK                        equ 0001h
CWG1ISM_ISM1_POSN                        equ 0001h
CWG1ISM_ISM1_POSITION                    equ 0001h
CWG1ISM_ISM1_SIZE                        equ 0001h
CWG1ISM_ISM1_LENGTH                      equ 0001h
CWG1ISM_ISM1_MASK                        equ 0002h
CWG1ISM_ISM2_POSN                        equ 0002h
CWG1ISM_ISM2_POSITION                    equ 0002h
CWG1ISM_ISM2_SIZE                        equ 0001h
CWG1ISM_ISM2_LENGTH                      equ 0001h
CWG1ISM_ISM2_MASK                        equ 0004h
CWG1ISM_ISM3_POSN                        equ 0003h
CWG1ISM_ISM3_POSITION                    equ 0003h
CWG1ISM_ISM3_SIZE                        equ 0001h
CWG1ISM_ISM3_LENGTH                      equ 0001h
CWG1ISM_ISM3_MASK                        equ 0008h

// Register: CWG1DBR
#define CWG1DBR CWG1DBR
CWG1DBR                                  equ 03BEh
// bitfield definitions
CWG1DBR_DBR_POSN                         equ 0000h
CWG1DBR_DBR_POSITION                     equ 0000h
CWG1DBR_DBR_SIZE                         equ 0008h
CWG1DBR_DBR_LENGTH                       equ 0008h
CWG1DBR_DBR_MASK                         equ 00FFh
CWG1DBR_DBR0_POSN                        equ 0000h
CWG1DBR_DBR0_POSITION                    equ 0000h
CWG1DBR_DBR0_SIZE                        equ 0001h
CWG1DBR_DBR0_LENGTH                      equ 0001h
CWG1DBR_DBR0_MASK                        equ 0001h
CWG1DBR_DBR1_POSN                        equ 0001h
CWG1DBR_DBR1_POSITION                    equ 0001h
CWG1DBR_DBR1_SIZE                        equ 0001h
CWG1DBR_DBR1_LENGTH                      equ 0001h
CWG1DBR_DBR1_MASK                        equ 0002h
CWG1DBR_DBR2_POSN                        equ 0002h
CWG1DBR_DBR2_POSITION                    equ 0002h
CWG1DBR_DBR2_SIZE                        equ 0001h
CWG1DBR_DBR2_LENGTH                      equ 0001h
CWG1DBR_DBR2_MASK                        equ 0004h
CWG1DBR_DBR3_POSN                        equ 0003h
CWG1DBR_DBR3_POSITION                    equ 0003h
CWG1DBR_DBR3_SIZE                        equ 0001h
CWG1DBR_DBR3_LENGTH                      equ 0001h
CWG1DBR_DBR3_MASK                        equ 0008h
CWG1DBR_DBR4_POSN                        equ 0004h
CWG1DBR_DBR4_POSITION                    equ 0004h
CWG1DBR_DBR4_SIZE                        equ 0001h
CWG1DBR_DBR4_LENGTH                      equ 0001h
CWG1DBR_DBR4_MASK                        equ 0010h
CWG1DBR_DBR5_POSN                        equ 0005h
CWG1DBR_DBR5_POSITION                    equ 0005h
CWG1DBR_DBR5_SIZE                        equ 0001h
CWG1DBR_DBR5_LENGTH                      equ 0001h
CWG1DBR_DBR5_MASK                        equ 0020h
CWG1DBR_CWG1DBR_POSN                     equ 0000h
CWG1DBR_CWG1DBR_POSITION                 equ 0000h
CWG1DBR_CWG1DBR_SIZE                     equ 0008h
CWG1DBR_CWG1DBR_LENGTH                   equ 0008h
CWG1DBR_CWG1DBR_MASK                     equ 00FFh
CWG1DBR_CWG1DBR0_POSN                    equ 0000h
CWG1DBR_CWG1DBR0_POSITION                equ 0000h
CWG1DBR_CWG1DBR0_SIZE                    equ 0001h
CWG1DBR_CWG1DBR0_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR0_MASK                    equ 0001h
CWG1DBR_CWG1DBR1_POSN                    equ 0001h
CWG1DBR_CWG1DBR1_POSITION                equ 0001h
CWG1DBR_CWG1DBR1_SIZE                    equ 0001h
CWG1DBR_CWG1DBR1_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR1_MASK                    equ 0002h
CWG1DBR_CWG1DBR2_POSN                    equ 0002h
CWG1DBR_CWG1DBR2_POSITION                equ 0002h
CWG1DBR_CWG1DBR2_SIZE                    equ 0001h
CWG1DBR_CWG1DBR2_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR2_MASK                    equ 0004h
CWG1DBR_CWG1DBR3_POSN                    equ 0003h
CWG1DBR_CWG1DBR3_POSITION                equ 0003h
CWG1DBR_CWG1DBR3_SIZE                    equ 0001h
CWG1DBR_CWG1DBR3_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR3_MASK                    equ 0008h
CWG1DBR_CWG1DBR4_POSN                    equ 0004h
CWG1DBR_CWG1DBR4_POSITION                equ 0004h
CWG1DBR_CWG1DBR4_SIZE                    equ 0001h
CWG1DBR_CWG1DBR4_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR4_MASK                    equ 0010h
CWG1DBR_CWG1DBR5_POSN                    equ 0005h
CWG1DBR_CWG1DBR5_POSITION                equ 0005h
CWG1DBR_CWG1DBR5_SIZE                    equ 0001h
CWG1DBR_CWG1DBR5_LENGTH                  equ 0001h
CWG1DBR_CWG1DBR5_MASK                    equ 0020h

// Register: CWG1DBF
#define CWG1DBF CWG1DBF
CWG1DBF                                  equ 03BFh
// bitfield definitions
CWG1DBF_DBF_POSN                         equ 0000h
CWG1DBF_DBF_POSITION                     equ 0000h
CWG1DBF_DBF_SIZE                         equ 0008h
CWG1DBF_DBF_LENGTH                       equ 0008h
CWG1DBF_DBF_MASK                         equ 00FFh
CWG1DBF_DBF0_POSN                        equ 0000h
CWG1DBF_DBF0_POSITION                    equ 0000h
CWG1DBF_DBF0_SIZE                        equ 0001h
CWG1DBF_DBF0_LENGTH                      equ 0001h
CWG1DBF_DBF0_MASK                        equ 0001h
CWG1DBF_DBF1_POSN                        equ 0001h
CWG1DBF_DBF1_POSITION                    equ 0001h
CWG1DBF_DBF1_SIZE                        equ 0001h
CWG1DBF_DBF1_LENGTH                      equ 0001h
CWG1DBF_DBF1_MASK                        equ 0002h
CWG1DBF_DBF2_POSN                        equ 0002h
CWG1DBF_DBF2_POSITION                    equ 0002h
CWG1DBF_DBF2_SIZE                        equ 0001h
CWG1DBF_DBF2_LENGTH                      equ 0001h
CWG1DBF_DBF2_MASK                        equ 0004h
CWG1DBF_DBF3_POSN                        equ 0003h
CWG1DBF_DBF3_POSITION                    equ 0003h
CWG1DBF_DBF3_SIZE                        equ 0001h
CWG1DBF_DBF3_LENGTH                      equ 0001h
CWG1DBF_DBF3_MASK                        equ 0008h
CWG1DBF_DBF4_POSN                        equ 0004h
CWG1DBF_DBF4_POSITION                    equ 0004h
CWG1DBF_DBF4_SIZE                        equ 0001h
CWG1DBF_DBF4_LENGTH                      equ 0001h
CWG1DBF_DBF4_MASK                        equ 0010h
CWG1DBF_DBF5_POSN                        equ 0005h
CWG1DBF_DBF5_POSITION                    equ 0005h
CWG1DBF_DBF5_SIZE                        equ 0001h
CWG1DBF_DBF5_LENGTH                      equ 0001h
CWG1DBF_DBF5_MASK                        equ 0020h
CWG1DBF_CWG1DBF_POSN                     equ 0000h
CWG1DBF_CWG1DBF_POSITION                 equ 0000h
CWG1DBF_CWG1DBF_SIZE                     equ 0008h
CWG1DBF_CWG1DBF_LENGTH                   equ 0008h
CWG1DBF_CWG1DBF_MASK                     equ 00FFh
CWG1DBF_CWG1DBF0_POSN                    equ 0000h
CWG1DBF_CWG1DBF0_POSITION                equ 0000h
CWG1DBF_CWG1DBF0_SIZE                    equ 0001h
CWG1DBF_CWG1DBF0_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF0_MASK                    equ 0001h
CWG1DBF_CWG1DBF1_POSN                    equ 0001h
CWG1DBF_CWG1DBF1_POSITION                equ 0001h
CWG1DBF_CWG1DBF1_SIZE                    equ 0001h
CWG1DBF_CWG1DBF1_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF1_MASK                    equ 0002h
CWG1DBF_CWG1DBF2_POSN                    equ 0002h
CWG1DBF_CWG1DBF2_POSITION                equ 0002h
CWG1DBF_CWG1DBF2_SIZE                    equ 0001h
CWG1DBF_CWG1DBF2_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF2_MASK                    equ 0004h
CWG1DBF_CWG1DBF3_POSN                    equ 0003h
CWG1DBF_CWG1DBF3_POSITION                equ 0003h
CWG1DBF_CWG1DBF3_SIZE                    equ 0001h
CWG1DBF_CWG1DBF3_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF3_MASK                    equ 0008h
CWG1DBF_CWG1DBF4_POSN                    equ 0004h
CWG1DBF_CWG1DBF4_POSITION                equ 0004h
CWG1DBF_CWG1DBF4_SIZE                    equ 0001h
CWG1DBF_CWG1DBF4_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF4_MASK                    equ 0010h
CWG1DBF_CWG1DBF5_POSN                    equ 0005h
CWG1DBF_CWG1DBF5_POSITION                equ 0005h
CWG1DBF_CWG1DBF5_SIZE                    equ 0001h
CWG1DBF_CWG1DBF5_LENGTH                  equ 0001h
CWG1DBF_CWG1DBF5_MASK                    equ 0020h

